// Напишите программу, которая на вход принимает два числа и 
// проверяет, является ли первое число квадатом второго.
// a = 25, b = 5 - да
// a = 2, b = 10 - нет
// a = 9, b = -3 - да
// a = -3, b = 9 - нет

int a = 25;
int b = 5;

if(a = b * b)
{
    Console.Write("Yes");
}
else
{
    Console.Write("No");
};