// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

int N = 8;
int a = 2;

while (a <= N)
{
    Console.WriteLine(a);
    a += 2;
};
